.. _sedol_userguide:

Stock Exchange Daily Official List Numbers
==========================================

Introduction
------------

The function :func:`clean_gb_sedol() <dataprep.clean.clean_gb_sedol.clean_gb_sedol>` cleans a column containing Stock Exchange Daily Official List number (SEDOL) strings, and standardizes them in a given format. The function :func:`validate_gb_sedol() <dataprep.clean.clean_gb_sedol.validate_gb_sedol>` validates either a single SEDOL strings, a column of SEDOL strings or a DataFrame of SEDOL strings, returning `True` if the value is valid, and `False` otherwise.

SEDOL strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "B15KXQ8"
* `standard`: SEDOL strings with proper whitespace in the proper places. Note that in the case of SEDOL, the compact format is the same as the standard one.
* `isin`: convert the number to an ISIN, like "GB00B15KXQ89".

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_gb_sedol()` and `validate_gb_sedol()`.

### An example dataset containing SEDOL strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "sedol": [
            'B15KXQ8',
            'B15KXQ7',
            '7542011030',
            '7552A10004',
            '8019010008',
            "hello",
            np.nan,
            "NULL",
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "1111 S Figueroa St, Los Angeles, CA 90015",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

        sedol                                           address
0     B15KXQ8                                     123 Pine Ave.
1     B15KXQ7                                           main st
2  7542011030                      1234 west main heights 57033
3  7552A10004                    apt 1 789 s maple rd manhattan
4  8019010008                robie house, 789 north main street
5       hello         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7        NULL                                             hello

## 1. Default `clean_gb_sedol`

By default, `clean_gb_sedol` will clean sedol strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_gb_sedol
clean_gb_sedol(df, column = "sedol")

        sedol                                           address sedol_clean
0     B15KXQ8                                     123 Pine Ave.     B15KXQ8
1     B15KXQ7                                           main st         NaN
2  7542011030                      1234 west main heights 57033         NaN
3  7552A10004                    apt 1 789 s maple rd manhattan         NaN
4  8019010008                robie house, 789 north main street         NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_gb_sedol(df, column = "sedol", output_format="standard")

        sedol                                           address sedol_clean
0     B15KXQ8                                     123 Pine Ave.     B15KXQ8
1     B15KXQ7                                           main st         NaN
2  7542011030                      1234 west main heights 57033         NaN
3  7552A10004                    apt 1 789 s maple rd manhattan         NaN
4  8019010008                robie house, 789 north main street         NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

### `compact`

In [4]:
clean_gb_sedol(df, column = "sedol", output_format="compact")

        sedol                                           address sedol_clean
0     B15KXQ8                                     123 Pine Ave.     B15KXQ8
1     B15KXQ7                                           main st         NaN
2  7542011030                      1234 west main heights 57033         NaN
3  7552A10004                    apt 1 789 s maple rd manhattan         NaN
4  8019010008                robie house, 789 north main street         NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

### `isin`

In [5]:
clean_gb_sedol(df, column = "sedol", output_format="isin")

        sedol                                           address   sedol_clean
0     B15KXQ8                                     123 Pine Ave.  GB00B15KXQ89
1     B15KXQ7                                           main st           NaN
2  7542011030                      1234 west main heights 57033           NaN
3  7552A10004                    apt 1 789 s maple rd manhattan           NaN
4  8019010008                robie house, 789 north main street           NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015           NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles           NaN
7        NULL                                             hello           NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned SEDOL strings is added with a title in the format `"{original title}_clean"`.

In [6]:
clean_gb_sedol(df, column="sedol", inplace=True)

  sedol_clean                                           address
0     B15KXQ8                                     123 Pine Ave.
1         NaN                                           main st
2         NaN                      1234 west main heights 57033
3         NaN                    apt 1 789 s maple rd manhattan
4         NaN                robie house, 789 north main street
5         NaN         1111 S Figueroa St, Los Angeles, CA 90015
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles
7         NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [7]:
clean_gb_sedol(df, "sedol", errors="coerce")

        sedol                                           address sedol_clean
0     B15KXQ8                                     123 Pine Ave.     B15KXQ8
1     B15KXQ7                                           main st         NaN
2  7542011030                      1234 west main heights 57033         NaN
3  7552A10004                    apt 1 789 s maple rd manhattan         NaN
4  8019010008                robie house, 789 north main street         NaN
5       hello         1111 S Figueroa St, Los Angeles, CA 90015         NaN
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

### `ignore`

In [8]:
clean_gb_sedol(df, "sedol", errors="ignore")

        sedol                                           address sedol_clean
0     B15KXQ8                                     123 Pine Ave.     B15KXQ8
1     B15KXQ7                                           main st     B15KXQ7
2  7542011030                      1234 west main heights 57033  7542011030
3  7552A10004                    apt 1 789 s maple rd manhattan  7552A10004
4  8019010008                robie house, 789 north main street  8019010008
5       hello         1111 S Figueroa St, Los Angeles, CA 90015       hello
6         NaN  (staples center) 1111 S Figueroa St, Los Angeles         NaN
7        NULL                                             hello         NaN

## 4. `validate_gb_sedol()`

`validate_gb_sedol()` returns `True` when the input is a valid SEDOL. Otherwise it returns `False`.

The input of `validate_gb_sedol()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_gb_sedol()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_gb_sedol()` returns the validation result for the whole DataFrame.

In [9]:
from dataprep.clean import validate_gb_sedol
print(validate_gb_sedol('B15KXQ8'))
print(validate_gb_sedol('B15KXQ7'))
print(validate_gb_sedol('7542011030'))
print(validate_gb_sedol('7552A10004'))
print(validate_gb_sedol('8019010008'))
print(validate_gb_sedol("hello"))
print(validate_gb_sedol(np.nan))
print(validate_gb_sedol("NULL"))

True
False
False
False
False
False
False
False

### Series

In [10]:
validate_gb_sedol(df["sedol"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: sedol, dtype: bool

### DataFrame + Specify Column

In [11]:
validate_gb_sedol(df, column="sedol")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
7    False
Name: sedol, dtype: bool

### Only DataFrame

In [12]:
validate_gb_sedol(df)

   sedol  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False
7  False    False